app/controllers/home_controller.rb

    def index
        if logged_in?
          @all_completed = CompletedTask.find_all_by_user_id(current_user.id)
          @all_attempted = AttemptedTask.find(:first, :select => ["sum(counter) as total"], :conditions => ["user_id=#{current_user.id}"])

          total_energy = 0
          if all_completed_tasks.size > 0
              for completed in all_completed_tasks
                  total_energy += completed.task.energy
              end
          end

          if current_user.facebook_user?
              begin
                  if current_user.attempted_tasks.size <= 0 and current_user.lotteries.size <= 0 and current_user.negotiations.size <= 0
---
SELECT * FROM `completed_tasks` WHERE (`completed_tasks`.`user_id` = 21)
SELECT * FROM `users` WHERE (`users`.`id` = 21) LIMIT 1
SELECT count(*) AS count_all FROM `attempted_tasks` WHERE (`attempted_tasks`.user_id = 21)
SELECT * FROM `negotiations` WHERE (`negotiations`.`user_id` = 21)
SELECT count(*) AS count_all FROM `lotteries` WHERE (`lotteries`.user_id = 21)
SELECT count(*) AS count_all FROM `negotiations` WHERE (`negotiations`.user_id = 21)

                              @friend.save
                          end
                      end
                      current_user.update_attribute("total_friends", @friends.size)
---
SELECT * FROM `friends` WHERE (`friends`.user_id = 21)

                    #current_user.update_attribute("energy", (2*@screen_names.size) - total_energy) if current_user.energy == 0
              end
          end
          @activities = Activity.find_all_by_user_id(current_user.id)
---
SELECT * FROM `activities` WHERE (`activities`.`user_id` = 21)