app/controllers/offers_controller.rb

SELECT * FROM `notifications` WHERE (`notifications`.`user_id` = 21) LIMIT 1
UPDATE `users` SET `points` = 14242481, `updated_at` = '2009-09-21 06:29:36' WHERE `id` = 21
INSERT INTO `notifications` (`point_send`, `negotiate`, `updated_at`, `point_receive`, `lottery_lost`, `task_fail`, `negotiation_lost`, `user_id`, `negotiation_win`, `task_done`, `lottery_win`, `created_at`) VALUES(0, 1, '2009-09-21 06:29:36', 0, 0, 0, 0, 21, 0, 0, 0, '2009-09-21 06:29:36')
---
    def notification
      @notification = Notification.find_by_user_id(current_user.id) if logged_in?
      @total_increase = total_increase(@notification)
      if params[:notification]
          if @notification
            @notification.update_attributes(params[:notification])
            flash[:notice] = "Notifications updated successfully"
            flag = false
          else
              @notification = Notification.new(params[:notification])
              @notification.user = current_user
              @notification.save

SELECT * FROM `attempted_tasks` WHERE (user_id=21)
SELECT * FROM `tasks` WHERE (style='Neutral' and item_id is null and id not in (select task_id from completed_tasks where user_id=21))
SELECT sum(counter) as total FROM `attempted_tasks` WHERE (user_id=21) LIMIT 1
---
    def tasks
#        @alltasks = Task.find(:all, :limit => 12, :order => "rand()")

#        @alltasks = Task.find(:all, :group => "category")
#        for task in @alltasks
#          item = Item.find(:all, :order => "rand()", :limit => 1)
#          task.update_attribute("item_id", item[0].id )
#        end

        @attempted_tasks = AttemptedTask.find(:all, :conditions => ["user_id=#{current_user.id}"])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `points` = 296845, `updated_at` = '2009-12-09 09:16:49' WHERE `id` = 1
INSERT INTO `activities` (`message`, `updated_at`, `user_id`, `created_at`) VALUES('Ankit B. Parekh negotiated with Ankit Parekh and lost 53 points.', '2009-12-09 09:16:49', 1, '2009-12-09 09:16:49')
INSERT INTO `negotiations` (`lost_points`, `updated_at`, `neg_category_id`, `won_points`, `negotiate_with`, `user_id`, `created_at`) VALUES(53, '2009-12-09 09:16:49', 14, NULL, 21, 1, '2009-12-09 09:16:49')
---
    def negotiated
        @user = User.find(params[:id])
        @random_value = rand(30)
        @points = rand(50) + 50

        @negotiation = Negotiation.new
        @negotiation.user = current_user
        @negotiation.negotiate_with = @user.id
        @negotiation.neg_category_id = params[:category_id]

        if @random_value >= 20
              @negotiation.won_points = @points
              current_user.update_attribute("points", current_user.points + @points)
              Activity.create(:user_id => current_user.id, :message => "#{current_user.screen_name} negotiated with #{@user.screen_name} and won #{@points} points.")