app/controllers/users_controller.rb

  def link_user_accounts
    if self.current_user.nil?
      #register with fb
      User.create_from_fb_connect(facebook_session.user)
    else
      #connect accounts
      self.current_user.link_fb_connect(facebook_session.user.id) unless self.current_user.fb_uid == facebook_session.user.id
    end
    if current_user.style
        @last_task = AttemptedTask.find(:last, :conditions => ["user_id=#{current_user.id}"], :order => "updated_at")
---
SELECT * FROM `attempted_tasks` WHERE (user_id=21) ORDER BY updated_at DESC LIMIT 1
SELECT * FROM `users` WHERE (`users`.`fb_uid` = 1066634600) LIMIT 1